Revit 2024 API
ReferenceArrayArray.ForwardIterator Method
Retrieve a forward moving iterator to the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual ReferenceArrayArrayIterator ForwardIterator()
Visual Basic
Public Overridable Function ForwardIterator As ReferenceArrayArrayIterator
Visual C++
public:
virtual ReferenceArrayArrayIterator^ ForwardIterator()
Return Value
Returns a forward moving iterator to the array.
See Also
ReferenceArrayArray Class
Autodesk.Revit.DB Namespace